[{"page_content":{"head":"How to Convert Bookmarklet to Chrome Extension | self.li - blog by Peter Legierski","body":"self.li - note to self and share with others, blog by Peter Legierski Peter Legierski /pronounced as leg-year-ski/ Occasional workaholic, regular teaholic. Maker of things. Fat, powdered nose, indoor climber! Currently working on my personal project MRR.io. Check it out! How to Convert Bookmarklet to Chrome Extension I ran into the problem of converting from one to another a while ago and all I could find was a bunch of tutorials that didn’t help too much, half of them outdated or with missing pieces of code. There was no way that simple copy-paste will solve my problem. Surely, I can’t be the only person that has few useful bookmarklets, but want to save up space and hide bookmarks bar altogether. This post is on Hacker News and Life Hacker. Join discussion: Hacker News link Life Hacker link Click here to use Bookmarklet to Chrome Extension Converter Now it turns out that I somehow skipped this piece of code that looks pretty similar to code generated by converter, but before that discovery, I thought: I’m a developer, so there is only one reasonable solution to my problem: I will create my own bookmarklet to Chrome extension converter. It’s ready and you can find it here. All you have to do is to figure out some clever name and description, drag bookmarklet into textarea and hit “Generate” button. You can also browse source code on GitHub. I think it’s pretty good start point to see how simple Chrome extension looks like and develop it further, if you fancy learning basics of something new over the weekend. Want to use your own icon? Replace three png files in the folder and you’re good to go! If you read this far, you should follow me on Twitter. You can also read about: Logging in with QR codes World’s Largest Wi-Fi Network Keeps Passwords in Plain Text Recommend: Posted 8 years ago - 16 Comments 1-800-mattress liked this web-freak liked this mascsubman4friends liked this jeffcarroll liked this graysky reblogged this from blog-self-li rchk liked this ethertank reblogged this from blog-self-li and added: ブックマークレットを Chrome のエクステンションに変換してくれる。使ってみたけど、素晴らしかった。 ethertank liked this diana2345d-blog liked this joelhamill reblogged this from blog-self-li and added: This is amazing. emileeyou89-blog liked this fedxc liked this solakv liked this damenleeturks liked this mhaidarh liked this mrsugarbombs liked this quasidot reblogged this from blog-self-li eltoby liked this blog-self-li posted this #Slim framework #bookmarklet #chrome #convert #extension #tool #useful #converter #simple self.li - Peter Legierski - @peterlegierski"}}]